Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeToposolid
Can't construct toposolid.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWallError
Cannot create wall - it would intersect itself. Reduce the wall's height or slant.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWall
Cannot create wall - it would intersect itself. Reduce the wall's height or slant.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateTaperedWallForWallTypeError
Cannot create tapered wall - the Wall Type is unacceptable. Be sure to choose a variable-thickness layer in the Wall Type.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateTaperedWallForWallType
Cannot create tapered wall - the Wall Type is unacceptable. Be sure to choose a variable-thickness layer in the Wall Type.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayersError
Cannot create wall - its layers would degenerate or. Reduce the wall's height or slant.

Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayers
Cannot create wall - its layers would degenerate or intersect. Reduce the wall's height or slant.